Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: དྲང་སྲོང་གི་ཆོས་ཇི་ལྟར་འདོད་པ་ཡོངས་སུ་རྫོགས་པའམ། དེས་སྨྲས་པ།
en: Or is there any accomplishment of ṛṣis’ dharma that is desired?”

source: རི་བོ་ཁོ་བོ་ནི་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་མགྲོན་དུ་བོས་པ་ཡང་མ་ཡིན།
en: “Śaila,” he replied, “I have not invited my fellow ṛṣis.

source: ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་བཟོ་སྦྱངས་གཟུགས་ཅན་སྙིང་པོ་ཡང་མ་ཡིན། ཕོ་བྲང་འཁོར་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་ཀྱང་མ་ཡིན།
en: I have not invited King Śreṇya Bimbisāra of Magadha or people dwelling around the palace.

source: དྲང་སྲོང་གི་ཆོས་ཇི་ལྟར་འདོད་པ་ཡོངས་སུ་རྫོགས་པ་ཡང་མ་ཡིན་མོད་ཀྱི།
en: This is not any accomplishment of ṛṣis’ dharma that is desired, either.

source: འོན་ཀྱང་ཁོ་བོས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་གདུགས་ཚོད་ལ་སྤྱན་དྲངས་སོ།
en: But I have invited the community of monks headed by the Buddha for a meal.”

source: །དེས་སངས་རྒྱས་ཞེས་བྱ་བའི་སྒྲ་སྔོན་མ་ཐོས་པ་ཐོས་ནས་བ་སྤུ་ཐམས་ཅད་ཟིང་ཞེས་བྱེད་ནས་གུས་པ་དང་བཅས་པས་དྲིས་པ། དྲང་སྲོང་སངས་རྒྱས་ཞེས་བྱ་བ་དེ་ཅི་ཞིག་ཡིན།
en: When Śaila heard the sound buddha, a sound he had never heard before, the hair on his entire body stood on end. He asked respectfully, “O ṛṣi, who is the Buddha?”

source: རི་བོ་དགེ་སྦྱོང་གཽ་ཏམ་ཤཱཀྱའི་སྲས་ཤཱཀྱའི་རིགས་ལས་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ནས་གོས་ངུར་སྨྲིག་བགོས་ཏེ་དད་པ་ཡང་དག་པ་ཁོ་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ནས་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ཞིག་ཡོད་དེ།
en: “Śaila, there is a son of the Śākyans called śramaṇa Gautama, one who went forth from the Śākyan family into homelessness in true faith, having shaved off his hair and beard and donned saffron robes. He was awakened to complete and supreme awakening.

source: རི་བོ་སངས་རྒྱས་ཞེས་བྱ་བ་ནི་དེ་ཡིན་ནོ།
en: Śaila, he is the Buddha.”

source: །རི་བོས་སྨྲས་པ། དྲང་སྲོང་དགེ་འདུན་ཞེས་བྱ་བ་འདི་ཅི་ཞིག་ཡིན།
en: “O ṛṣi,” asked Śaila, “what is the community?”

source: དྲང་སྲོང་ཀེ་ནའི་བུས་སྨྲས་པ། རི་བོ་རྒྱལ་རིགས་ཀྱི་རིགས་ཀྱི་བུ་རྣམས་ལས་ཀྱང་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ནས་གོས་ངུར་སྨྲིག་བགོས་ཏེ་དད་པ་ཡང་དག་པ་ཁོ་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་བ་ཡང་ཡོད།
en: “Śaila,” the ṛṣi Kaineya replied, “among the sons of kṣatriya families, there are those who went forth from their home into homelessness in true faith, having shaved off their hair and beards and donned saffron robes.

source: བྲམ་ཟེའི་རིགས་དང་། རྗེའུའི་རིགས་དང་། དམངས་རིགས་ཀྱི་རིགས་ཀྱི་བུ་རྣམས་ལས་ཀྱང་ཞེས་བྱ་བ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རབ་ཏུ་བྱུང་བ་དེ་ཉིད་ཀྱི་རྗེས་སུ་རབ་ཏུ་བྱུང་བ་ཡོད་དེ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུ་སྟེ།
en: Among the sons of brahmin families, vaiśya families, and śūdra families, too, there are those who went forth . . . following the Blessed One, the Tathāgata, the Arhat, the Perfectly Awakened One, who had gone forth.

source: རི་བོ་འདི་ནི་དགེ་འདུན་ཞེས་བྱའོ།
en: Śaila, these are the community.

source: །རི་བོ་དགེ་འདུན་འདི་དང་སྔར་སྨོས་པའི་སངས་རྒྱས་ཏེ་སངས་རྒྱས་ལ་སོགས་པའི་དགེ་སློང་གི་དགེ་འདུན་འདི་ཁོ་བོས་གདུགས་ཚོད་ལ་སྤྱན་དྲངས་སོ།
en: Śaila, I have invited this community and the Buddha that I already mentioned, namely, ‘the community of monks headed by the Buddha,’ for a meal.”

source: །དེ་ནས་དྲང་སྲོང་རི་བོས་སངས་རྒྱས་ལ་དམིགས་པའི་དྲན་པས་ནང་པར་སྔར་ལངས་ཏེ་འཁོར་ལྔ་བརྒྱ་དང་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: Thereupon, being mindful of the Buddha, the ṛṣi Śaila rose early in the morning and went to the Blessed One with his five hundred attendants. When he arrived, he bowed low until his forehead touched the Blessed One’s feet, and then he sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་དྲང་སྲོང་རི་བོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་བདག་རབ་ཏུ་འབྱུང་བ་དང་བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་ཐོབ་པ་ལྟ་ན།
en: Having sat down to one side, the ṛṣi Śaila said to the Blessed One, “O Honored One, I wish to go forth and be ordained a monk in the well-taught Dharma and Vinaya.

source: བདག་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཚངས་པར་སྤྱད་པར་བགྱིའོ། །དྲང་སྲོང་རི་བོ་དང་འཁོར་ལྔ་བརྒྱས་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་བྱུང་བ་དང་བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་ཐོབ་པར་གྱུར་ཏོ།། །།འདུལ་བ་གཞི། བམ་པོ་ལྔ་བཅུ་དགུ་པ།
en: I will lead the pure life in the presence of the Blessed One.” The ṛṣi Śaila and his five hundred attendants then attained monkhood, which belongs to those who have gone forth and have been ordained in the well-taught Dharma and Vinaya.

source: དེ་ནས་དྲང་སྲོང་ཀེ་ནའི་བུས་དེ་ཉིད་ཀྱི་ནུབ་མོ་ནས་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་དག་ཅེས་བྱ་བ་ནས་བསྟབས་ཤིང་ཚིམ་པར་བྱས་སོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: Thereupon the ṛṣi Kaineya prepared a pure and fine meal during the night . . . served and satisfied them . . . .

source: །དེས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་གདུགས་ཚོད་གསོལ་བ་ན་རི་བོ་རབ་ཏུ་བྱུང་བ་མཐོང་ནས་དེས་སྨྲས་པ།
en: When he served the community of monks headed by the Buddha with a meal, he saw Śaila, who had gone forth.

source: རི་བོ་ཁྱོད་རབ་ཏུ་བྱུང་ངམ།
en: He asked him, “Śaila, did you go forth?”

source: རབ་ཏུ་བྱུང་ངོ་།
en: “Yes, I did.”

source: །ལེགས་པར་བྱས་སོ།
en: “Well done!

source: །ཤིན་ཏུ་ལེགས་པར་བྱས་སོ།
en: Well done, indeed!

source: །ཁོ་བོ་ཡང་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་གདུགས་ཚོད་གསོལ་ཟིན་ནས་རབ་ཏུ་འབྱུང་ངོ་།
en: I will go forth, too, after I have finished serving the meal to the community of monks headed by the Buddha.”

source: །དེ་ནས་དྲང་སྲོང་ཀེ་ནའི་བུས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་རྣམ་གྲངས་དུ་མར་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་དག་རང་གི་ལག་ནས་བསྟབས་ཤིང་ཚིམ་པར་བྱས་སོ།
en: Then the ṛṣi Kaineya, with his own hands and in a variety of ways, served and satisfied the community of monks headed by the Buddha with a pure and fine meal.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་གསོལ་ཟིན་ནས་ཕྱག་བཅབས་ཏེ། ལྷུང་བཟེད་གྱུ་བར་རིག་ནས་སྟན་ཆེས་དམའ་བ་ཞིག་བླངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཆོས་མཉན་པའི་ཕྱིར་འདུག་གོ།
en: Knowing the Blessed One had finished his meal and washed his hands and his bowl, he took a low seat and sat before the Blessed One in order to hear the Dharma.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་ཡོན་བསྔོ་བ་དང་ཆོས་བཤད་པ་མཛད་ནས་གཤེགས་སོ།
en: Then the Blessed One assigned the rewards of the offerings to him, gave a sermon, and departed.

source: །དེ་ནས་དྲང་སྲོང་ཀེ་ནའི་བུས་རྒྱུ་ལྷག་དེ་དག་ཐམས་ཅད་བཏང་བའི་ཆོས་བྱས་ནས་འཁོར་ལྔ་བརྒྱ་དང་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: Thereupon the ṛṣi Kaineya, having thrown off everything unnecessary, went to the Blessed One with his five hundred attendants. When he arrived, he bowed low until his forehead touched the Blessed One’s feet, and then he sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་དྲང་སྲོང་ཀེ་ནའི་བུས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་བདག་རབ་ཏུ་འབྱུང་བ་དང་བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་ཐོབ་པ་ལྟ་ན།
en: Having sat down to one side, the ṛṣi Kaineya said to the Blessed One, “O Honored One, I wish to go forth and be ordained a monk in the well-taught Dharma and Vinaya.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཚངས་པར་སྤྱད་པར་བགྱིའོ། །དྲང་སྲོང་ཀེ་ནའི་བུ་འཁོར་ལྔ་བརྒྱ་དང་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་བྱུང་བ་དང་བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་ཐོབ་པར་གྱུར་ཏོ།
en: I will lead the pure life in the presence of the Blessed One.” The ṛṣi Kaineya with his five hundred attendants then attained monkhood, which belongs to those who have gone forth and have been ordained in the well-taught Dharma and Vinaya. 5.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་རབ་ཏུ་བྱུང་ཞིང་བསྙེན་པར་རྫོགས་པའི་དགེ་སློང་སྟོང་པོ་དེ་དག་དང་། འབབ་ཆུ་རབ་ཏུ་བཟང་པོའི་འགྲམ་དུ་ཨ་མྲའི་ཚལ་གདུགས་ལྟ་བུར་དབྱར་གནས་པར་ཞལ་གྱིས་བཞེས་སོ།
en: The Instruction by Three Disciples of the Buddha Thereupon the Blessed One undertook the rainy-season retreat in the Parasol mango grove on the bank of the river Prabhadrikā with those thousand monks who had newly gone forth and had been ordained.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་བྲམ་ཟེ་ཀ་པི་ན་ལ་དགེ་སློང་ལྔ་བརྒྱ་གཏད་དོ། །ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་ཉིས་བརྒྱ་ལྔ་བཅུ་གཏད་དོ། །ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་ཉིས་བརྒྱ་ལྔ་བཅུ་གཏད་དོ།
en: There, the Blessed One entrusted five hundred monks to the venerable Brāhmaṇa­kapphiṇa, two hundred and fifty to the venerable Mahā­maudgalyāyana, and two hundred and fifty to the venerable Śāriputra.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་བྲམ་ཟེ་ཀ་པི་ནས་གདམས་ངག་ཕོག་པ་གང་ཡིན་པ་དེ་དག་ནི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་སོ། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོའི་གང་དག་ཡིན་པ་དེ་དག་ནི་ལན་གཅིག་ཕྱིར་འོང་བའི་འབྲས་བུའོ། །ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་གང་དག་ཡིན་པ་དེ་དག་ནི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུའོ།
en: Those who were instructed by the venerable Brāhmaṇa­kapphiṇa abandoned all the defilements and actualized the state of an arhat, those by the venerable Mahā­maudgalyāyana the fruit of once-returners, and those by the venerable Śāriputra the fruit of stream-entry. 6. The Former Lives of the Three Disciples

source: །དགེ་སློང་རྣམས་ཐེ་ཚོམ་སྐྱེས་ནས་ཐེ་ཚོམ་ཐམས་ཅད་གཅོད་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ནི་ཤེས་རབ་ཆེ་བ་རྣམས་དང་། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ནི་མཐུ་ཆེ་བ་དང་། རྫུ་འཕྲུལ་ཆེ་བ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ལགས་ན། འོན་ཀྱང་ཚེ་དང་ལྡན་པ་བྲམ་ཟེ་ཀ་པི་ནས་གདམས་ངག་ཕོག་པ་གང་དག་ལགས་པ་དེ་དག་ནི་དགྲ་བཅོམ་པ། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོའི་གང་དག་ལགས་པ་དེ་དག་ནི་ལན་གཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་གང་དག་ལགས་པ་དེ་དག་ནི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བགྱིས་པ་ལ་གཟིགས།
en: The monks, feeling doubtful, inquired of the Buddha, the Blessed One, the one who severs all doubts, “How is it, O Honored One, that, although the Blessed One has praised the venerable Śāriputra as the best of those who have great wisdom, and the venerable Mahā­maudgalyāyana as the best of those who have great power and great magical power, those who were instructed by the venerable Brāhmaṇa­kapphiṇa actualized the state of an arhat, those by the venerable Mahā­maudgalyāyana the fruit of once-returners, and those by the venerable Śāriputra the fruit of stream-entry?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་ད་ལྟར་དུ་མ་ཟད་ཇི་ལྟར་འདས་པའི་དུས་ན་ཡང་ཀ་པི་ནའི་གདམས་ངག་ཕོག་པ་གང་དག་ཡིན་པ་དེ་དག་ནི་གཟུགས་མེད་པའི་ཁམས་ལ་རབ་ཏུ་བཀོད། མཽད་གལ་གྱི་བུའི་གང་དག་ཡིན་པ་དེ་དག་ནི་གཟུགས་ཀྱི་ཁམས་དང་། ཤཱ་རིའི་བུའི་གང་དག་ཡིན་པ་དེ་དག་ནི་མངོན་པར་ཤེས་པ་ལྔ་ལ་རབ་ཏུ་བཀོད་པ་དེ་ཉོན་ཅིག །དགེ་སློང་དག་སྔོན་བྱུང་བ་དགོན་པའི་གནས་ཞིག་ན་དྲང་སྲོང་གཉིས་ཤིག་གནས་ཏེ་སོ་སོར་འཁོར་ལྔ་བརྒྱ་ལྔ་བརྒྱ་ཡོད་དོ།
en: “Listen, monks,” the Blessed One replied, “how, not only in the present but also in the past, those who were instructed by Brāhmaṇa­kapphiṇa were established in the formless realm, those by Maudgalyāyana in the form realm, and those by Śāriputra in the five kinds of supernormal knowledge. “Monks, there once lived two ṛṣis in the wilderness, each of whom had five hundred attendants.

source: །ཇི་ཙམ་དུས་གཞན་ཞིག་ན་དེ་གཉིས་ལས་གཅིག་ཤི་ནས་དེའི་བྲམ་ཟེའི་ཁྱེའུ་རྣམས་བླ་མ་དང་བྲལ་བའི་སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བས་གདུངས་ནས་ཕན་ཚུན་འཕྱན་འཕྱན་ནས་དྲང་སྲོང་ཅིག་ཤོས་དེའི་དྲུང་དུ་འོངས་པ་དང་། དེས་དེ་རྣམས་མིག་མཆི་མས་གང་བ་མཐོང་ནས་དྲིས་པ། བྲམ་ཟེའི་ཁྱེའུ་དག་ཁྱེད་ཀྱི་མཁན་པོ་དེ་གར་སོང་། གུམ་མོ།
en: One day, one of those two died. His young brahmins, tormented by pain and despair over parting from their teacher, wandered here and there and came to the other ṛṣi. When he saw them with their eyes full of tears, he asked them, ‘Young brahmins, where did your teacher go?’ “ ‘He died.’

source: །དེས་བསམས་པ། བདག་འདས་ན་བྲམ་ཟེའི་ཁྱེའུ་རྣམས་འདི་འདྲ་བའི་གནས་སྐབས་སུ་འགྱུར་གྱིས།
en: “He thought, ‘After my death, my young brahmins will be in the same situation as these ones.

source: མ་ལ་བདག་གིས་འདི་དག་བསྡུ་བར་བྱའོ་སྙམ་ནས་དེས་དེ་རྣམས་དབུགས་ཕྱུང་སྟེ་བསྡུས་སོ།
en: I will now accept them.’ He then encouraged them and accepted them.

source: །ཇི་ཙམ་དུས་གཞན་ཞིག་ན་དྲང་སྲོང་དེ་ཡང་ནད་ཀྱིས་ཐེབས་པར་གྱུར་ནས།
en: “Later, one day, this ṛṣi also became sick.

source: དེའི་སློབ་མ་མཆོག་གསུམ་ཡོད་པ་ལ་དེས་གཅིག་ལ་ནི་ལྔ་བརྒྱ། གཉིས་པ་ལ་ནི་ཉིས་བརྒྱ་ལྔ་བཅུ། གསུམ་པ་ལ་ནི་ཉིས་བརྒྱ་ལྔ་བཅུ་གཏད་དོ།
en: He had three best pupils, and he entrusted five hundred young brahmins to the first one, two hundred and fifty to the second one, and another two hundred and fifty to the third one.

source: །དེ་ནི་འཆི་བའི་ཆོས་དང་ལྡན་པར་གྱུར་ཏོ།
en: Then, he passed away.

source: །དེ་ལ་ལྔ་བརྒྱ་གཏད་པ་གང་ཡིན་པ་དེས་ནི་ཇི་ལྟར་གཟུགས་མེད་པའི་ཁམས་ལ་བཀོད་པ་དེ་ལྟར་གདམས་ངག་ཕོག་གོ།
en: “At that point, the one who was entrusted with five hundred instructed them so that they were established in the formless realm;

source: །ཉིས་བརྒྱ་ལྔ་བཅུ་གཏད་པ་གང་ཡིན་པ་དེས་ནི་ཇི་ལྟར་གཟུགས་ཀྱི་ཁམས་ལ་བཀོད་པ་དེ་ལྟར་གདམས་ངག་ཕོག་གོ།
en: the second who was entrusted with two hundred and fifty instructed them so that they were established in the form realm;

source: །ཉིས་བརྒྱ་ལྔ་བཅུ་ཕོག་པ་ཅིག་ཤོས་ཀྱིས་ནི་ཇི་ལྟར་མངོན་པར་ཤེས་པ་ལྔ་ལ་བཀོད་པ་དེ་ལྟར་གདམས་ངག་ཕོག་གོ།
en: and the third who was assigned two hundred and fifty instructed them so that they were established in the five supernormal powers.

source: དེའི་ཚེ་དེའི་དུས་ཀྱི་དྲང་སྲོང་བྲམ་ཟེའི་ཁྱེའུ་ལྔ་བརྒྱ་གཟུགས་མེད་པའི་ཁམས་ལ་འགོད་པ་གང་ཡིན་པ་དེ་ནི་དགེ་སློང་ཀ་པི་ན་འདི་ཉིད་ཡིན་ནོ།
en: That ṛṣi who established five hundred young brahmins in the formless realm at that time, on that occasion, was indeed this monk Kapphiṇa.

source: །ཉིས་བརྒྱ་ལྔ་བཅུ་གཟུགས་ཀྱི་ཁམས་ལ་རབ་ཏུ་འགོད་པ་གང་ཡིན་པ་དེ་ནི་དགེ་སློང་མཽད་གལ་གྱི་བུ་འདི་ཉིད་ཡིན་ནོ།
en: The one who established two hundred and fifty in the form realm was indeed this monk Maudgalyāyana.

source: །ཅིག་ཤོས་ཀྱིས་ཉིས་བརྒྱ་ལྔ་བཅུ་མངོན་པར་ཤེས་པ་ལྔ་ལ་རབ་ཏུ་དགོད་པ་གང་ཡིན་པ་དེ་ནི་དགེ་སློང་ཤཱ་རིའི་བུ་འདི་ཉིད་ཡིན་ནོ།
en: The other one who established two hundred and fifty in the five kinds of supernormal knowledge was indeed this monk Śāriputra.

source: །འོན་ཀྱང་དགེ་སློང་ཀ་པི་ནས་གདམས་ངག་ཕོག་པ་གང་ཡིན་པ་དེ་ནི་དབང་པོ་རྣོན་པོ་ཡིན་ནོ། །མཽད་གལ་གྱི་བུའི་གང་ཡིན་པ་དེ་དག་ནི་དབང་པོ་འབྲིང་པོ་ཡིན་ནོ། །ཤཱ་རིའི་བུའི་གང་ཡིན་པ་དེ་དག་ནི་དབང་པོ་རྟུལ་པོ་ཡིན་ནོ།
en: “However, monks, those who were instructed by Kapphiṇa are of keen faculties, those by Maudgalyāyana are of mediocre faculties, and those by Śāriputra are of dull faculties.

source: །གལ་ཏེ་ཤཱ་རིའི་བུས་གདམས་ངག་ཕོག་པར་མ་གྱུར་ན་དེ་དག་གིས་དྲོ་བར་གྱུར་པ་ཡང་རྟོགས་པར་མི་འགྱུར་རོ།
en: If they had not been instructed by Śāriputra, they would not even have attained the stage of warmth.” B. The Conversion of Kaineya and Śaila (Verse)

source: །ཀེ་ནའི་བུ་ནི་རལ་པ་ཅན།
en: Just as Kaineya, who had dreadlocked hair,

source: །ཇི་ལྟར་སངས་རྒྱས་བསྔགས་བརྗོད་པ། །རབ་ཏུ་དང་བའི་སེམས་ཀྱིས་ནི།
en: Expressed his praise of the Buddha,

source: །ཐམས་ཅད་མཐུན་པར་མཉན་པར་གྱིས།
en: Everyone should listen in harmony With their minds filled with faith.

source: །ཀེ་ནའི་བུ་ཡི་ཁྱིམ་དུ་ནི། །དུས་གཅིག་ཅིག་ན་སྟོན་པ་པོ།
en: One day, in Kaineya’s house,

source: །དཔའ་ཆེན་ཉན་ཐོས་ཐབས་ཅིག་ཏུ།
en: The Teacher possessing great power

source: །གདུགས་ཚོད་ལ་ནི་སྤྱན་དྲངས་སོ།
en: Was invited for a meal

source: །ཀེ་ནའི་བུ་ཡི་ཁྱིམ་དུ་ནི།
en: With his disciples. In Kaineya’s house,

source: །ཟས་ཀྱི་ཞལ་ཏ་བྱེད་པ་དག །བྲམ་ཟེ་རི་བོས་མཐོང་གྱུར་ཏེ།
en: The ṛṣi Śaila saw A meal being prepared.

source: །མཐོང་ནས་ཀེ་ནའི་བུ་ལ་དྲིས།
en: When he saw that, he asked Kaineya,

source: །བག་མ་ལེན་ཏམ་འོན་ཏེ་ཅི།
en: “Are you having a wedding?

source: །རྒྱལ་པོ་ཡུལ་འཁོར་མགྲོན་བོས་སམ།
en: Or have you invited the king or the whole kingdom?

source: །ཁྱོད་ཀྱི་མཆོད་སྦྱིན་ཆེ་དུས་སམ།
en: Is this your great offering?

source: །དྲིས་པ་དེ་ནི་བདག་ལ་སྨྲོས།
en: Please answer my question.”

source: །བདག་ནི་བག་མ་མི་ལེན་ལ།
en: “I am not having any wedding,

source: །རྒྱལ་པོའམ་ཡུལ་འཁོར་མགྲོན་མ་བོས།
en: Nor have I invited the king or the whole kingdom.

source: །བདག་གིས་སངས་རྒྱས་སེམས་དཔའ་མཆོག །གདུགས་ཚོད་ལ་ནི་སྤྱན་དྲངས་སོ།
en: I have invited the Buddha, The best living being, for a meal.”

source: །རི་བོས་སངས་རྒྱས་སྒྲ་ཐོས་ནས།
en: When Śaila heard the sound buddha,

source: །ཡིད་སྐྱོ་བ་ནི་སྐྱེས་གྱུར་ཏེ།
en: His mind was stirred up.

source: །སངས་རྒྱས་དེ་ཅི་ཀེ་ནའི་བུ།
en: “What is that buddha, Kaineya?

source: །ཤཱཀྱའི་རིགས་ལས་སྐྱེས་པ་ཡི། །སྟོན་པ་གང་ཟག་ཟླ་མེད་ཡོད།
en: Born into the Śākyan family.

source: །དེ་ནི་ཆོས་ཀུན་བློ་ལྡན་པས།
en: He possesses understanding (buddhi) of all dharmas—

source: །དེ་བས་སངས་རྒྱས་ཞེས་བྱའོ།
en: Therefore, he is called Buddha.

source: །འདུས་བྱས་འཇིག་པར་འགྱུར་བའི་ཆོས།
en: “All conditioned things have a destructible nature.

source: །འདས་པ་སངས་རྒྱས་ཀྱིས་གཟིགས་ལ།
en: The Buddha saw the past;

source: །དེ་བཞིན་མ་འོངས་པ་གཟིགས་ཤིང་།
en: Likewise, he sees the future

source: །ད་ལྟར་བྱུང་བ་རྣམས་ཀྱང་གཟིགས།
en: And also the present.

source: །མངོན་ཤེས་བྱ་བ་ཇི་སྙེད་པ།
en: “The omniscient one knows

source: །དེ་ཀུན་རྟོགས་པས་ཐམས་ཅད་རིག །ཐམས་ཅད་མཁྱེན་ཅིང་ཐམས་ཅད་གཟིགས།
en: Everything that may be recognized. He knows everything and sees everything—

source: །དེ་བས་སངས་རྒྱས་ཞེས་བྱའོ། །མངོན་པར་ཤེས་བྱ་མངོན་ཤེས་བྱས།
en: Therefore, he is called Buddha. “He has recognized what is to be recognized,

source: །བསྒོམ་པར་བྱ་བ་རྣམས་ཀྱང་བསྒོམས།
en: Has meditated upon what is to be meditated upon,

source: །སྤང་བར་བྱ་བ་སྤངས་པས་ན།
en: And has abandoned what is to be abandoned—

source: །གང་ཞིག་བལྟམས་པར་གྱུར་པ་ན།
en: The land quaked,

source: །རྒྱ་མཚོ་རི་བོར་བཅས་པ་ཡི། །ས་འདི་རབ་ཏུ་གཡོས་མཛད་པ།
en: Including its oceans and mountains—

source: །དེ་ལ་ཐལ་སྦྱར་ཕྱག་འཚལ་ལོ།
en: To him I make the gesture of supplication and bow.

source: །གང་གིས་བདུད་དང་ནག་པོ་ཡི།
en: “The one who defeated Māra,

source: །རྩ་ལག་བཞོན་བཅས་བཅོམ་ནས་ནི།
en: The friend of darkness, with his minions,

source: །དེ་བཞིན་གཤེགས་ཀྱི་སྟོབས་ཐོབ་པ།
en: And attained the power of a tathāgata—

source: །བཱ་རཱ་ཎ་སཱིའི་གྲོང་བཞུད་ནས། །གང་གིས་རྣམ་པ་བཅུ་གཉིས་པའི།
en: “The one who went to the city of Vārāṇasī

source: །ཆོས་ཀྱི་འཁོར་ལོ་དེ་བསྐོར་བ། །དེ་ལ་ཐལ་སྦྱར་ཕྱག་འཚལ་ལོ།
en: And turned the wheel of the Dharma Consisting of twelve elements— To him I make the gesture of supplication and bow. “The one who liberated many beings

source: །གང་གིས་འདོད་ཆགས་བཅིང་བས་བཅིངས།
en: Bound by the fetters of desire

source: །འདོད་ཆགས་ཞེ་སྡང་གིས་གདུངས་པའི། །སེམས་ཅན་མང་པོ་གྲོལ་མཛད་པའི།
en: And tormented by desire and hatred—

source: །སངས་རྒྱས་བཅོམ་ལྡན་གང་ཞིག་ན།
en: “Where is the Buddha, the Blessed One?

source: །རྣམ་འདྲེན་དེ་ནི་ཇི་སྲིད་ན།
en: How far from here is that leader? I will seek refuge from today onward

source: །ཤཱཀྱའི་སྲས་པོ་འོད་མཛད་ལ།
en: In the son of the Śākyans, who is like the sun.”

source: །དེ་རིང་ཉིད་ནས་སྐྱབས་སུ་འགྲོ།
en: “Go, brahmin, and

source: །ཚལ་སྡུག་ཡིད་དུ་འོང་བ་དེ།
en: In that pleasant grove you will

source: །གང་ན་བ་ནི་བྲམ་ཟེའི་ཆོས།
en: See the Buddha, the supreme one,

source: །དྲི་ཟའི་རྒྱལ་པོ་ལྟ་བུ་ཡི། །སངས་རྒྱས་བླ་མེད་མཐོང་བར་གྱུར།
en: Who is like the king of gandharvas,

source: །ན་བཟའ་ངུར་སྨྲིག་འོད་ལྡན་དེ།
en: “Whose saffron robe is bright,

source: །གསེར་མདོག་ཉི་མའི་འོད་ཟེར་ཅན།
en: Who, golden-colored, emits sun-like rays of light

source: །དེ་བཞིན་གསེར་ནི་བཙོ་མ་ཡི།
en: And looks like heated gold

source: །གསེར་ལས་གཟུགས་ནི་བྱས་པ་བཞིན།
en: Or an image made of gold, “Who is like the flower of the sāla tree

source: །སཱ་ལ་ཤིང་གི་མེ་ཏོག་དང་། །ཀར་ནི་ཀ་རའི་མེ་ཏོག་འདྲ།
en: And the karṇikāra flower, Who is like a jeweled pillar

source: །རིན་ཆེན་སྣ་ཚོགས་སྤྲས་པ་ཡི། །རིན་ཆེན་མཆོད་སྡོང་ཇི་བཞིན་ནོ།
en: Covered with various jewels. “Well balanced in his height and girth

source: །ནྱ་གྲོ་དྷ་ལྟ་བུར་ནི།
en: Like a banyan tree,

source: །ཆུ་ཞེང་གབ་པར་གྱུར་པ་དང་། །ཁོར་ཡུག་འདོམ་གང་འོད་ཀྱིས་ནི།
en: He illuminates his surroundings

source: །ཀུན་ནས་སྣང་བ་དག་ཏུ་མཛད།
en: With a fathom-wide halo.

source: །རྒྱལ་སྲིད་རྒྱས་དང་ཉེ་དུར་བཅས།
en: “The Muni, who abandoned his magnificent kingdom

source: །འདོད་པ་ཀུན་དགའ་སྤངས་ནས་ནི།
en: Abundant in the objects of desire and pleasure, where his relatives were,

source: །རབ་ཏུ་བྱུང་བར་མངོན་བྱུང་བའི།
en: And departed to go forth,

source: །ཐུབ་པ་དབེན་པ་རྣམས་ལ་དགྱེས།
en: Rejoices in solitude.

source: །སྤོས་ངད་ལྡང་བའི་སེང་གེ་ནི།
en: “Just as a lion on Mount Gandhamādana

source: །ནགས་སུ་འཇིགས་པ་མེད་པ་ལྟར།
en: Has no fear in the forest,

source: །སེང་གེ་ལྟ་བུར་བསྙེངས་མེད་གསུང་།
en: He speaks without fear like a lion—

source: །བྲམ་ཟེ་སངས་རྒྱས་མཐོང་བར་འགྱུར།
en: Brahmin, you will see him, the Buddha.

source: །ཞལ་འཛུམ་འཇམ་པའི་གསུང་དང་ནི།
en: “He smiles, speaks gentle words

source: །ཚངས་པའི་གསུང་དང་སྙན་པའི་གསུང་།
en: With Brahmā’s voice, a sweet voice,

source: །རྔ་ཡི་སྒྲ་ཡི་གསུང་ལྟ་བུའི།
en: And his voice is like the sound of drums—

source: །སངས་རྒྱས་བྲམ་ཟེ་མཐོང་བར་འགྱུར།
en: Brahmin, you will see him, the Buddha. “He is like the disk of the moon,

source: །ཟླ་བ་དག་པ་ནམ་མཁའ་ལ།
en: The clear moon

source: །རྒྱུ་སྐར་རྣམས་ཀྱིས་ཡོངས་བསྐོར་བའི། །ཟླ་བའི་དཀྱིལ་འཁོར་ལྟ་བུ་ཡི།
en: Surrounded by constellations in the sky—

source: །ཉི་མའི་འོད་ཟེར་དང་ལྡན་པ།
en: “Just as the sun emitting rays of light

source: །ནམ་མཁའི་ངོས་ལ་མཛེས་ལྟ་ཡི།
en: Is beautiful in the sky,

source: །སངས་རྒྱས་མུན་པ་བྲལ་གྱུར་ཅིང་།
en: The Buddha, free from darkness, is beautiful—

source: །མཛེས་པ་བྲམ་ཟེ་མཐོང་བར་འགྱུར།
en: Brahmin, you will see him. “The bull among men, possessed of the ten powers,

source: །ཇི་ལྟར་ཁྱུ་བའི་ཁྱུ་མཆོག་ནི།
en: Is just like a bull with a hump, the head of its herd,

source: །ནོག་དང་ལྡན་པ་མི་གཡོ་གནས། །སྐྱེས་བུ་ཁྱུ་མཆོག་སྟོབས་བཅུ་ལྡན།
en: Standing immovably—

source: །རྒྱ་མཚོ་དག་ནི་གཏིང་ཟབ་པའི། །ཆུ་ཆེན་ཚད་གཟུང་མེད་ལྟ་ཡི།
en: The deep, immeasurable great ocean,

source: །སངས་རྒྱས་བསམ་གཏན་པ་ཡི་མཆོག །བསམ་གྱིས་མི་ཁྱབ་བླ་མེད་མཐོང་།
en: The Buddha, the best of meditators, Is inconceivable and unsurpassed—you will see him.

source: །ནག་པོའི་ཕྱོགས་ལས་ངེས་བྱུང་བའི།
en: “Like the sun after the dark half of the month,

source: །ཉི་མ་མཁའ་ལ་གསལ་བ་དང་། །མེ་ཡི་ཕུང་པོ་འབར་བ་ལྟའི།
en: Which is bright in the sky Like a mass of burning fire—

source: །གཽ་ཏམ་སངས་རྒྱས་མཐོང་བར་འགྱུར།
en: You will see him, the Buddha Gautama.

source: །ཇི་ལྟར་འཁོར་ལོས་སྒྱུར་རྒྱལ་པོ། །ཞབས་འབྲིང་བྱེ་བས་ཡོངས་བསྐོར་ལྟར།
en: “Just as a wheel-turning king is Surrounded by ten million ministers,

source: །དེ་བཞིན་རྫོགས་པའི་སངས་རྒྱས་ནི།
en: The Completely Awakened One,

source: །དགྲ་བཅོམ་རྣམས་ཀྱིས་མདུན་བྱས་མཛེས།
en: Who is served by arhats, is beautiful.

source: །འདོད་པ་རྣམས་ལ་དབང་སྒྱུར་དང་། །ཇི་ལྟར་ཚངས་ཆེན་དབང་ཕྱུག་ལྟར། །སྟོང་གསུམ་གྱི་ནི་འཇིག་རྟེན་ཁམས།
en: “Just like the one reigning over the desire realm And Mahābrahmā, the ruler, The Muni reigns Over the worlds of the billionfold universe. “The truths of various kinds of suffering, The arising of suffering, The cessation of suffering,

source: །ཐུབ་པ་དབང་ནི་སྒྱུར་བར་མཛད།
en: And the path consisting of eight parts—

source: །གང་ཐོས་ཉེ་བར་ཞི་འགྱུར་ཞིང་།
en: “Through the hearing of which one will be pacified,

source: །སྡུག་བསྔལ་མཚོ་ཆེན་ལས་སྒྲོལ་བ། །སྡུག་བསྔལ་རྣམ་པ་དུ་མ་དང་། །སྡུག་བསྔལ་ཀུན་འབྱུང་གང་ཡིན་དང་། །སྡུག་བསྔལ་ཉེ་བར་ཞི་བ་དང་། །ལམ་ནི་ཡན་ལག་བཞི་ཚན་གཉིས།
en: And will cross the great ocean of suffering— He reveals these truths,

source: །སྦྲང་རྩི་མ་བསྐོལ་རོ་ལྟ་བུའི། །བདེན་པ་དག་ནི་རབ་ཏུ་འཆད།
en: Which taste like pure honey.

source: །ནོར་མེད་རྣམས་ལ་ནོར་སྦྱིན་ཞིང་།
en: “He gives wealth to those who lack wealth,

source: །ནད་པ་རྣམས་ཀྱི་དཔྱད་ཀྱང་མཛད།
en: Cures the sick,

source: །གནོད་པ་རྣམས་ཀྱི་སྐྱབས་གྱུར་པས། །སྐྱེ་དགུ་སྡུག་བསྔལ་གྲོལ་བར་མཛད།
en: Becomes a refuge to those who are hurt, And liberates beings from suffering. “He shows the safe, straight path That leads to nirvāṇa To blinded beings

source: །མུན་པར་གྱུར་པའི་སེམས་ཅན་དང་། །བླུན་པོ་ལམ་གོལ་རྒྱུ་བ་དང་། །བདེ་བ་མྱ་ངན་འདས་འགྲོ་བའི། །ལམ་ནི་དྲང་པོ་རབ་ཏུ་སྟོན།
en: And foolish ones treading wrong paths.

source: །འདོད་ཆགས་ཞེ་སྡང་ཀུན་འབར་ཞིང་།
en: “Humans burnt by desire and hatred

source: །གཏི་མུག་རབ་འབར་སྐྱེ་དགུ་རྣམས།
en: And inflamed by delusion— The Great Muni pacifies them

source: །ཇི་ལྟར་སྤྲིན་ཆེན་ཆར་འབེབས་ལྟར། །ཐུབ་པ་ཆེན་པོས་ཞི་བར་མཛད།
en: Just as a large cloud causes rain. “There are none equal to him,

source: །གཟུགས་དང་ཁ་དོག་སྟོབས་ལྡན་པ། །དེ་དང་འདྲ་བ་ཡོད་མ་ཡིན།
en: Who possesses excellent appearance, complexion, and power.
